docs/org/docs.org
#+TITLE: Documentation
#+AUTHOR: Petros Papapanagiotou
#+EMAIL: petros@workflowfm.com
#+OPTIONS: toc:nil email:t 
#+EXCLUDE_TAGS: noexport
#+PROPERTY: header-args :results output drawer :session workflowfm :exports both :eval no-export :dir ../../
#+HUGO_AUTO_SET_LASTMOD: t

#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: docs


** Actions
   :PROPERTIES:
   :EXPORT_FILE_NAME: actions
   :EXPORT_HUGO_WEIGHT: 220
   :END:

Before we introduce process specifications, we need to discuss how composition is broken down into binary /actions/ and how /state/ is managed for each action.

*** Actionstate

Each composition action corresponds to a reasoning tactic implemented in HOL Light. These tactics require an extended proof state to function appropriately. This is extension is captured iusing the ~Actionstate~ structure.

{{< tip >}}
The user is not required to manipulate the actionstate themselves, unless they perform low level proofs.
{{< /tip >}}

The final actionstate resulting from a composition proof is provided within the reasoner's response, so it may be useful to explain its structure briefly here.

The ~Actionstate~ structure is [[https://github.com/workflowfm/workflowfm-reasoner/blob/master/src/processes/actions.ml][defined as follows]]:

#+BEGIN_SRC ocaml :eval no
module Actionstate = struct
  type t = {
      label : string;
      ctr : int;
      metas : term list;
      merged : (term * string * string) list;
      iprov : (term * provtree) list;
      prov : (string * provtree) list;
    }

(* ... *)
end;;
#+END_SRC

The fields can be described briefly as follows:
| Field              | Description                                                                           |
|--------------------+---------------------------------------------------------------------------------------|
| ~label~            | A unique name for the given composition, typically the name of the resulting process. |
| ~ctr~              | A unique counter for each reasoning step during composition.                          |
| ~metas~            | A list of metavariables used during composition.                                      |
| ~merged~           | A list of merged inputs during a conditional composition.                             |
| ~iprov & prov~     | [[../provenance][Provenance tracking]] for inputs and outputs respectively.                             |

The unique name and counter are used to guarantee uniqueness of introduced channel names.

Merged inputs occur during conditional composition, when both processes have the same input type, so that the final composition does not duplicate inputs. Each entry consists of the input term as it appears in the composition paired with the names of the 2 input channels that got merged.

*** Actions



